#include "sys.h"
  /**************************************************************************
作者：平衡小车之家
我的淘宝小店：http://shop114407458.taobao.com/
**************************************************************************/

u8 flag;
int main(void)
{ 
  	Stm32_Clock_Init(9);            //=====系统时钟设置
  	delay_init(72);                 //=====延时初始化
	  uart_init(72,9600);             //=====初始化串口1  
    uart3_init(36,9600);            //=====串口3初始化
	  while(1)
		{     
		  static u8 a;
	    if(a++>100)
			a=1;
			flag=!flag;
		 	if(flag==0)  printf("{A%d:%d:%d:%d}$",a,a,40,a);//打印到APP上面
			else         printf("{B%d:%d:%d:%d}$",a+10,a*2,a-10,a-2);//打印到APP上面
      delay_ms(50);
		} 
}
