/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#include <LiquidCrystal.h>

#define LM35 A0

LiquidCrystal lcd(12,11,5,4,3,2);			//构造一个LiquidCrystal的类成员。使用数字IO ，12,11,5,4,3,2

int val = 0;				//存放AD变量值
float temp = 0;			//存放温度值的10倍

void setup()
{
  lcd.begin(16,2);		//初始化LCD1602
  lcd.print("Welcome to use!");		//液晶显示Welcome to use！
  delay(1000);				//延时1000ms
  lcd.clear();				//液晶清屏
}

void loop()
{
  val = analogRead(LM35);		//读取AD值
  temp = val * 4.8876;			//转换为温度值的10倍，有利于液晶显示
  lcd.setCursor(0,0);				//设置液晶开始显示的指针位置
  lcd.print("LM35 temp =");	//液晶显示“LM35 temp =”
  lcd.setCursor(0,1);				//设置液晶开始显示的指针位置
  lcd.print((int)temp/10);	//液晶显示温度整数值
  lcd.print(".");						//液晶显示小数点
  lcd.print((int)temp%10);	//液晶显示温度小数值
  
  lcd.print((char)223);			//液晶显示“°”
  lcd.print("C");						//液晶显示“C”
  delay(1000);							//延时1000ms
}


