/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#define Pot A0
#define LED 3

int PotBuffer = 0;

void setup()
{
  pinMode(LED,OUTPUT);		//IO输出
}

void loop()
{
  PotBuffer = analogRead(Pot);			//读取AD值
  PotBuffer = map(PotBuffer, 0, 1023, 0, 255);//把AD值0-1023 缩放为 0-255
  analogWrite(LED,PotBuffer);				//PWM调光，输出PWM,占空比为PotBuffer/255
}
