/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#define Pot A0			//电位器引脚命名

int PotBuffer = 0;		//AD读取数据缓存变量

void setup()
{
  Serial.begin(9600);			//初始化串口波特率为9600
}

void loop()
{
  PotBuffer = analogRead(Pot);	//读取AD值
  Serial.print("Pot = ");				//串口输出“Pot = ”
  Serial.println(PotBuffer);		//串口输出PotBuffer的值
  delay(500);										//延时500ms
}
