/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#define Pot A0
#define Buzzer 2

int PotBuffer = 0;

void setup()
{
  pinMode(Buzzer,OUTPUT);	//蜂鸣器引脚设定为输出
}

void loop()
{
  PotBuffer = analogRead(Pot);		//读取AD值
  
  for(int i = 0 ; i < 100 ; i++)		//循环100次
  {
    digitalWrite(Buzzer,HIGH);		//设置输出高电平
    delayMicroseconds(PotBuffer);	//延时PotBuffer值 us
    digitalWrite(Buzzer,LOW);			//设置输出低电平
    delayMicroseconds(100);				//延时100us
  }

  
  delay(1000);										//延时1000ms
}
