/******************************************************************************
----------------本例程仅供学习使用，未经作者允许，不得用于其他用途。-----------
------------------------版权所有，仿冒必究！-----------------------------------
----------------1.开发环境:Arduino IDE-----------------------------------------
----------------2.测试使用开发板型号：Arduino Leonardo or Arduino UNO R3-------
----------------3.单片机使用晶振：16M------------------------------------------
----------------4.淘宝网址：Ilovemcu.taobao.com--------------------------------
----------------------------epic-mcu.taobao.com--------------------------------
----------------5.作者：神秘藏宝室---------------------------------------------
******************************************************************************/
#include <Arduino.h>
#include "DS18B20.h"

float Temp_Buffer = 0;
DS18B20 myDS18B20(2);

void setup()			//Arduino程序初始化程序放在这里，只在开机时候运行一次
{
	Serial.begin(9600);	//设置通讯的波特率为9600
	Serial.println("Welcome to use!");  //发送的内容
	Serial.println("Ilovemcu.taobao.com");  //发送的内容
}

void loop()			//Arduino程序的主程序部分，循环运行内部程序
{
	Temp_Buffer = myDS18B20.Get_temp();
	Serial.println(Temp_Buffer,1);
        delay(500);
}
